-- +goose Up
-- +goose StatementBegin

INSERT INTO training.exercise_group_types (code, name)
VALUES ('legs', '🦵 Ноги'),
       ('press', '📰 Пресс'),
       ('deltas', 'δ Дельты'),
       ('back', '🏋 Спина'),
       ('chest', '🫀 Грудь'),
       ('biceps', '💪 Бицепс'),
       ('triceps', '💪🏻 Трицепс'),
       ('cardio', '🏃 Кардио');

INSERT INTO training.exercise_types (id, name, url, exercise_group_type_code, rest_in_seconds, accent)
VALUES (1, 'Разгибание голени сидя', 'https://disk.yandex.ru/i/nevoPFhHbc8l8g', 'legs', 120,
        'передняя поверхность бедра'),
       (2, 'Сгибание голени сидя', 'https://disk.yandex.ru/i/PqkWBjSSNvH-Vg', 'legs', 120,
        'задняя поверхность бедра'),
       (3, 'Жим платформы ногами', 'https://disk.yandex.ru/i/UsaW3YjvDRWm3w', 'legs', 180,
        'передняя поверхность бедра'),
       (4, 'Подъем ног в висе на локтях', 'https://disk.yandex.ru/i/pkAxqVWTe4L_Xw', 'press', 90,
        'прямая мышца живота'),
       (5, 'Обратные разведения в пек-дек', 'https://disk.yandex.ru/i/9lYAV1wr3VjWQQ', 'deltas', 120,
        'задняя дельтовидная мышца'),
       (6, 'Протяжка штанги', 'https://disk.yandex.ru/i/0aaEdn5IBOI6zQ', 'deltas', 120, 'средняя дельтовидная мышца'),
       (7, 'Подтягивание в гравитроне широким хватом', 'https://disk.yandex.ru/i/jp52K-HTe86iLA', 'back', 120,
        'широчайшая мышца спины'),
       (8, 'Вертикальная тяга в рычажном тренажере', 'https://disk.yandex.ru/i/x6qRCfJBGA7tEQ', 'back', 120,
        'широчайшая мышца спины'),
       (9, 'Горизонтальная тяга в блочном тренажере с упором в грудь', 'https://disk.yandex.ru/i/DnyJDcPaJLUyCg',
        'back', 120, 'широчайшая мышца спины'),
       (10, 'Тяга гантели с упором в скамью', 'https://disk.yandex.ru/i/mU9TIaxDPV6nXw', 'back', 120,
        'широчайшая мышца спины'),
       (11, 'Сгибание рук с супинацией гантелями', 'https://disk.yandex.ru/i/LWBPrSeWvxNiUw', 'biceps', 120,
        'двуглавая мышца плеча'),
       (12, 'Молотковые сгибания с гантелями', 'https://disk.yandex.ru/i/OvY5i3YGxyi6gw', 'biceps', 120,
        'брахиалис + плечевая мышца'),
       (13, 'Жим лежа широким хватом', 'https://disk.yandex.ru/i/w2FIsYgqMQ-RPA', 'chest', 180, 'грудные мышцы'),
       (14, 'Жим горизонтально в тренажере TechnoGym', 'https://disk.yandex.ru/i/vyDhCyusHft5VQ', 'chest', 120,
        'грудные мышцы'),
       (15, 'Сведение рук в тренажере бабочка', 'https://disk.yandex.ru/i/JADkjm4tiUsAdQ', 'chest', 120,
        'грудные мышцы'),
       (16, 'Французский жим с гантелями лежа', 'https://disk.yandex.ru/i/9KPxatabvDYy8g', 'triceps', 120,
        'трехглавая мышца плеча'),
       (17, 'Разгибание на трицепс с верхнего блока канатной рукоятью', 'https://disk.yandex.ru/i/sG8luvJYQWNgyg',
        'triceps', 120, 'трехглавая мышца плеча'),
       (18, 'Ходьба', '', 'cardio', 0, ''),
       (19, 'Бег на дорожке', '', 'cardio', 0, ''),
       (20, 'Бег на механической дорожке', '', 'cardio', 0, ''),
       (21, 'Велосипед', '', 'cardio', 0, '');
-- +goose StatementEnd

-- +goose Down
-- +goose StatementBegin
TRUNCATE TABLE training.exercise_types;
TRUNCATE TABLE training.exercise_group_types;
-- +goose StatementEnd
